project-chip/connectedhomeip/examples/platform/silabs/efr32/rs911x/sl_wifi_if.c
/*
 *
 *    Copyright (c) 2023 Project CHIP Authors
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "sl_status.h"
#include "silabs_utils.h"

#include "FreeRTOS.h"
#include "event_groups.h"
#include "sl_board_configuration.h"
#include "sl_net.h"
#include "sl_si91x_host_interface.h"
#include "sl_si91x_types.h"
#include "sl_wifi_callback_framework.h"
#include "sl_wifi_constants.h"
#include "sl_wifi_types.h"
#include "sl_wlan_config.h"
#include "task.h"
#include "wfx_host_events.h"

#include "ble_config.h"

#include "dhcp_client.h"
#include "lwip/nd6.h"
#include "sl_wifi.h"
#include "wfx_host_events.h"
#include "wfx_rsi.h"
#define ADV_SCAN_THRESHOLD           -40
#define ADV_RSSI_TOLERANCE_THRESHOLD 5
#define ADV_ACTIVE_SCAN_DURATION     15
#define ADV_PASSIVE_SCAN_DURATION    20
#define ADV_MULTIPROBE               1
#define ADV_SCAN_PERIODICITY         10

struct wfx_rsi wfx_rsi;

/* Declare a variable to hold the data associated with the created event group. */
StaticEventGroup_t rsiDriverEventGroup;

bool hasNotifiedIPV6 = false;
#if (CHIP_DEVICE_CONFIG_ENABLE_IPV4)
bool hasNotifiedIPV4 = false;
#endif /* CHIP_DEVICE_CONFIG_ENABLE_IPV4 */
bool hasNotifiedWifiConnectivity = false;

/* Declare a flag to differentiate between after boot-up first IP connection or reconnection */
bool is_wifi_disconnection_event = false;

/* Declare a variable to hold connection time intervals */
uint32_t retryInterval              = WLAN_MIN_RETRY_TIMER_MS;
volatile bool scan_results_complete = false;
#define WIFI_SCAN_TIMEOUT 10000

extern osSemaphoreId_t sl_rs_ble_init_sem;

/*
 * This file implements the interface to the wifi sdk
 */

wfx_wifi_scan_ext_t * temp_reset;

volatile sl_status_t callback_status = SL_STATUS_OK;

/******************************************************************
 * @fn   int32_t wfx_rsi_get_ap_info(wfx_wifi_scan_result_t *ap)
 * @brief
 *       Getting the AP details
 * @param[in] ap: access point
 * @return
 *        status
 *********************************************************************/
int32_t wfx_rsi_get_ap_info(wfx_wifi_scan_result_t * ap)
{
    sl_status_t status            = SL_STATUS_OK;
    int32_t rssi = 0;
    ap->security = wfx_rsi.sec.security;
    ap->chan     = wfx_rsi.ap_chan;
    memcpy(&ap->bssid[0], &wfx_rsi.ap_mac.octet[0], BSSID_MAX_STR_LEN);
    sl_wifi_get_signal_strength(SL_WIFI_CLIENT_INTERFACE, &rssi);
    if(status == SL_STATUS_OK)
    {
        ap->rssi =  rssi;
    }
    return status;
}

/******************************************************************
 * @fn   int32_t wfx_rsi_get_ap_ext(wfx_wifi_scan_ext_t *extra_info)
 * @brief
 *       Getting the AP extra details
 * @param[in] extra info: access point extra information
 * @return
 *        status
 *********************************************************************/
int32_t wfx_rsi_get_ap_ext(wfx_wifi_scan_ext_t * extra_info)
{
    sl_status_t status        = SL_STATUS_OK;
    sl_wifi_statistics_t test = { 0 };
    status                    = sl_wifi_get_statistics(SL_WIFI_CLIENT_INTERFACE, &test);
    VERIFY_STATUS_AND_RETURN(status);
    extra_info->beacon_lost_count = test.beacon_lost_count - temp_reset->beacon_lost_count;
    extra_info->beacon_rx_count   = test.beacon_rx_count - temp_reset->beacon_rx_count;
    extra_info->mcast_rx_count    = test.mcast_rx_count - temp_reset->mcast_rx_count;
    extra_info->mcast_tx_count    = test.mcast_tx_count - temp_reset->mcast_tx_count;
    extra_info->ucast_rx_count    = test.ucast_rx_count - temp_reset->ucast_rx_count;
    extra_info->ucast_tx_count    = test.ucast_tx_count - temp_reset->ucast_tx_count;
    extra_info->overrun_count     = test.overrun_count - temp_reset->overrun_count;
    return status;
}

/******************************************************************
 * @fn   int32_t wfx_rsi_reset_count()
 * @brief
 *       Getting the driver reset count
 * @param[in] None
 * @return
 *        status
 *********************************************************************/
int32_t wfx_rsi_reset_count()
{
    sl_wifi_statistics_t test = { 0 };
    sl_status_t status        = SL_STATUS_OK;
    status                    = sl_wifi_get_statistics(SL_WIFI_CLIENT_INTERFACE, &test);
    VERIFY_STATUS_AND_RETURN(status);
    temp_reset->beacon_lost_count = test.beacon_lost_count;
    temp_reset->beacon_rx_count   = test.beacon_rx_count;
    temp_reset->mcast_rx_count    = test.mcast_rx_count;
    temp_reset->mcast_tx_count    = test.mcast_tx_count;
    temp_reset->ucast_rx_count    = test.ucast_rx_count;
    temp_reset->ucast_tx_count    = test.ucast_tx_count;
    temp_reset->overrun_count     = test.overrun_count;
    return status;
}

/******************************************************************
 * @fn   wfx_rsi_disconnect()
 * @brief
 *       Getting the driver disconnect status
 * @param[in] None
 * @return
 *        status
 *********************************************************************/
int32_t wfx_rsi_disconnect()
{
    return sl_wifi_disconnect(SL_WIFI_CLIENT_INTERFACE);
}

sl_status_t join_callback_handler(sl_wifi_event_t event, char * result, uint32_t result_length, void * arg)
{
    temp_reset = (wfx_wifi_scan_ext_t *) malloc(sizeof(wfx_wifi_scan_ext_t));
    memset(temp_reset, 0, sizeof(wfx_wifi_scan_ext_t));
    if (CHECK_IF_EVENT_FAILED(event))
    {
        SILABS_LOG("F: Join Event received with %u bytes payload\n", result_length);
        callback_status = *(sl_status_t *) result;
        wfx_rsi.join_retries += 1;
        wfx_rsi.dev_state &= ~(WFX_RSI_ST_STA_CONNECTING | WFX_RSI_ST_STA_CONNECTED);
        wfx_retry_interval_handler(is_wifi_disconnection_event, wfx_rsi.join_retries++);
        if (is_wifi_disconnection_event || wfx_rsi.join_retries <= WFX_RSI_CONFIG_MAX_JOIN)
        {
            xEventGroupSetBits(wfx_rsi.events, WFX_EVT_STA_START_JOIN);
        }
        is_wifi_disconnection_event = true;
        return SL_STATUS_FAIL;
    }
    /*
     * Join was complete - Do the DHCP
     */
    SILABS_LOG("%s: join completed.", __func__);
    SILABS_LOG("%c: Join Event received with %u bytes payload\n", *result, result_length);
    xEventGroupSetBits(wfx_rsi.events, WFX_EVT_STA_CONN);
    wfx_rsi.join_retries = 0;
    retryInterval        = WLAN_MIN_RETRY_TIMER_MS;
    is_wifi_disconnection_event = false;
    callback_status = SL_STATUS_OK;
    return SL_STATUS_OK;
}

#if CHIP_DEVICE_CONFIG_ENABLE_SED
/******************************************************************
 * @fn   wfx_rsi_power_save()
 * @brief
 *       Setting the RS911x in DTIM sleep based mode
 *
 * @param[in] None
 * @return
 *        None
 *********************************************************************/
int32_t wfx_rsi_power_save()
{
    int32_t status;
    status = rsi_bt_power_save_profile(2, 0);
    if (status != RSI_SUCCESS)
    {
        SILABS_LOG("BT Powersave Config Failed, Error Code : 0x%lX", status);
        return status;
    }

