project-chip/connectedhomeip/examples/platform/silabs/efr32/rs911x/sl_wifi_if.c
    sl_wifi_performance_profile_t wifi_profile = { ASSOCIATED_POWER_SAVE };
    status = sl_wifi_set_performance_profile(&wifi_profile);
    if (status != RSI_SUCCESS)
    {
        SILABS_LOG("Powersave Config Failed, Error Code : 0x%lX", status);
        return status;
    }
    SILABS_LOG("Powersave Config Success");
    return status;
}
#endif /* CHIP_DEVICE_CONFIG_ENABLE_SED */

/*************************************************************************************
 * @fn  static int32_t wfx_wifi_rsi_init(void)
 * @brief
 *      Wifi initialization called from app main
 * @param[in]  None
 * @return
 *        None
 *****************************************************************************************/
int32_t wfx_wifi_rsi_init(void)
{
  SILABS_LOG("wfx_wifi_rsi_init started");
  sl_status_t status;
  status = sl_wifi_init(&config  , default_wifi_event_handler);
  if(status != SL_STATUS_OK){
    SILABS_LOG("wfx_wifi_rsi_init failed %x", status);
    return status;
  }
  return status;
}

/*************************************************************************************
 * @fn  static int32_t wfx_rsi_init(void)
 * @brief
 *      driver initialization
 * @param[in]  None
 * @return
 *        None
 *****************************************************************************************/
static int32_t wfx_rsi_init(void)
{
    sl_status_t status;
    status = wfx_wifi_rsi_init();
    if(status != SL_STATUS_OK) {
      SILABS_LOG("wfx_rsi_init failed %x", status);
      return status;
    }

    status = sl_wifi_get_mac_address(SL_WIFI_CLIENT_INTERFACE, (sl_mac_address_t *) &wfx_rsi.sta_mac.octet[0]);
    if (status != SL_STATUS_OK)
    {
        SILABS_LOG("sl_wifi_get_mac_address failed: %x", status);
        return status;
    }

    wfx_rsi.events = xEventGroupCreateStatic(&rsiDriverEventGroup);
    wfx_rsi.dev_state |= WFX_RSI_ST_DEV_READY;
    osSemaphoreRelease(sl_rs_ble_init_sem);
    return status;
}

/*************************************************************************************
 * @fn  void wfx_show_err(char *msg)
 * @brief
 *      driver shows error message
 * @param[in]  msg
 * @return
 *        None
 *****************************************************************************************/
void wfx_show_err(char * msg)
{
    SILABS_LOG("%s: message: %d", __func__, msg);
}

sl_status_t scan_callback_handler(sl_wifi_event_t event, sl_wifi_scan_result_t * scan_result, uint32_t result_length, void * arg)
{
    if (CHECK_IF_EVENT_FAILED(event))
    {
        callback_status       = *(sl_status_t *) scan_result;
        scan_results_complete = true;
#if WIFI_ENABLE_SECURITY_WPA3_TRANSITION
        wfx_rsi.sec.security = WFX_SEC_WPA3;
#else
        wfx_rsi.sec.security = WFX_SEC_WPA2;
#endif /* WIFI_ENABLE_SECURITY_WPA3_TRANSITION */
        return SL_STATUS_FAIL;
    }
    wfx_rsi.sec.security = WFX_SEC_UNSPECIFIED;
    wfx_rsi.ap_chan      = scan_result->scan_info[0].rf_channel;
    memcpy(&wfx_rsi.ap_mac.octet, scan_result->scan_info[0].bssid, BSSID_MAX_STR_LEN);
    switch (scan_result->scan_info[0].security_mode)
    {
    case SL_WIFI_OPEN:
        wfx_rsi.sec.security = WFX_SEC_NONE;
        break;
    case SL_WIFI_WPA:
    case SL_WIFI_WPA_ENTERPRISE:
        wfx_rsi.sec.security = WFX_SEC_WPA;
        break;
    case SL_WIFI_WPA2:
    case SL_WIFI_WPA2_ENTERPRISE:
        wfx_rsi.sec.security = WFX_SEC_WPA2;
        break;
    case SL_WIFI_WEP:
        wfx_rsi.sec.security = WFX_SEC_WEP;
        break;
    case SL_WIFI_WPA3_TRANSITION:
#if WIFI_ENABLE_SECURITY_WPA3_TRANSITION
    case SL_WIFI_WPA3:
        wfx_rsi.sec.security = WFX_SEC_WPA3;
#else
        wfx_rsi.sec.security = WFX_SEC_WPA2;
#endif /* WIFI_ENABLE_SECURITY_WPA3_TRANSITION */
        break;
    default:
        wfx_rsi.sec.security = WFX_SEC_UNSPECIFIED;
        break;
    }
    scan_results_complete = true;
    return SL_STATUS_OK;
}
sl_status_t show_scan_results(sl_wifi_scan_result_t *scan_result)
{
  ARGS_CHECK_NULL_POINTER(scan_result);
  int x;
  wfx_wifi_scan_result_t ap;
  if (wfx_rsi.dev_state & WFX_RSI_ST_STA_CONNECTED)
  {
    for (x = 0; x < (int)scan_result->scan_count; x++)
    {
      strcpy(&ap.ssid[0], (char *) &scan_result->scan_info[x].ssid);
     // uint8_t *bssid = (uint8_t *)&scan_result->scan_info[x].bssid;
      if (wfx_rsi.scan_ssid)
      {
        SILABS_LOG("SCAN SSID: %s , ap scan: %s", wfx_rsi.scan_ssid, ap.ssid);
        if (strcmp(wfx_rsi.scan_ssid, ap.ssid) == CMP_SUCCESS)
        {
          ap.security = scan_result->scan_info[x].security_mode;
          ap.rssi     = (-1) * scan_result->scan_info[x].rssi_val;
          memcpy(&ap.bssid[0], &scan_result->scan_info[x].bssid[0], BSSID_MAX_STR_LEN);
          (*wfx_rsi.scan_cb)(&ap);
        }
      }
      else
      {
        ap.security = scan_result->scan_info[x].security_mode;
        ap.rssi     = (-1) * scan_result->scan_info[x].rssi_val;
        memcpy(&ap.bssid[0], &scan_result->scan_info[x].bssid[0], BSSID_MAX_STR_LEN);
        (*wfx_rsi.scan_cb)(&ap);
      }
    }
  }
  wfx_rsi.dev_state &= ~WFX_RSI_ST_SCANSTARTED;
  (*wfx_rsi.scan_cb)((wfx_wifi_scan_result_t *) 0);
  wfx_rsi.scan_cb = (void (*)(wfx_wifi_scan_result_t *)) 0;
  if (wfx_rsi.scan_ssid)
  {
    vPortFree(wfx_rsi.scan_ssid);
    wfx_rsi.scan_ssid = (char *) 0;
  }
  return SL_STATUS_OK;
}
sl_status_t bg_scan_callback_handler(sl_wifi_event_t event,
                                  sl_wifi_scan_result_t *result,
                                  uint32_t result_length,
                                  void *arg)
{
    callback_status = show_scan_results(result);
    scan_results_complete = true;
    return SL_STATUS_OK;
}
/***************************************************************************************
 * @fn   static void wfx_rsi_save_ap_info()
 * @brief
 *       Saving the details of the AP
 * @param[in]  None
 * @return
 *       None
 *******************************************************************************************/
static void wfx_rsi_save_ap_info() // translation
{
    sl_status_t status                                   = SL_STATUS_OK;
    sl_wifi_scan_configuration_t wifi_scan_configuration = { 0 };
    wifi_scan_configuration                              = default_wifi_scan_configuration;
    sl_wifi_ssid_t ssid_arg;
    ssid_arg.length = strlen(wfx_rsi.sec.ssid);
    memcpy(ssid_arg.value, (int8_t *) &wfx_rsi.sec.ssid[0], ssid_arg.length);
    sl_wifi_set_scan_callback(scan_callback_handler, NULL);
    status = sl_wifi_start_scan(SL_WIFI_CLIENT_2_4GHZ_INTERFACE, &ssid_arg, &wifi_scan_configuration);
    if (SL_STATUS_IN_PROGRESS == status)
    {
        const uint32_t start = osKernelGetTickCount();
        while (!scan_results_complete && (osKernelGetTickCount() - start) <= WIFI_SCAN_TIMEOUT)
        {
            osThreadYield();
        }
        status = scan_results_complete ? callback_status : SL_STATUS_TIMEOUT;
    }
    return ;
}

/********************************************************************************************
 * @fn   static void wfx_rsi_do_join(void)
 * @brief
 *        Start an async Join command
 * @return
 *        None
 **********************************************************************************************/
static void wfx_rsi_do_join(void)
{
    int32_t status;
    sl_wifi_security_t connect_security_mode;
    switch (wfx_rsi.sec.security)
    {
    case WFX_SEC_WEP:
        connect_security_mode = SL_WIFI_WEP;
        break;
    case WFX_SEC_WPA:
    case WFX_SEC_WPA2:
        connect_security_mode = SL_WIFI_WPA_WPA2_MIXED;
        break;
    case WFX_SEC_WPA3:
        connect_security_mode = SL_WIFI_WPA3;
        break;
    case WFX_SEC_NONE:
        connect_security_mode = SL_WIFI_OPEN;
        break;
    default:
        SILABS_LOG("%s: error: unknown security type.");
        return;
    }

